javier-moreno-tridonic-com/mbed-hal-st-stm32f0/source/i2c_api.c
/* mbed Microcontroller Library
 *******************************************************************************
 * Copyright (c) 2014, STMicroelectronics
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */
#include "mbed_assert.h"
#include "i2c_api.h"

#if DEVICE_I2C

#ifndef USE_STM32F0XX_HAL_I2C__FIX
//#error Please use stm32f0xx_hal_i2c__FIX.c
#endif

#include "cmsis.h"
#include "pinmap.h"
#include "PeripheralPins.h"

/* Timeout values for flags and events waiting loops. These timeouts are
   not based on accurate values, they just guarantee that the application will
   not remain stuck if the I2C communication is corrupted. */
#define FLAG_TIMEOUT ((int)0x1000)
#define LONG_TIMEOUT ((int)0x8000)
  
#define I2C_TIMEOUT_TCR     ((uint32_t)25)     /* 25 ms */
#define I2C_TIMEOUT_STOPF   ((uint32_t)25)     /* 25 ms */
#define I2C_TIMEOUT_TXIS    ((uint32_t)25)     /* 25 ms */
#define I2C_TIMEOUT_RXNE    ((uint32_t)25)     /* 25 ms */
#define I2C_TIMEOUT_FLAG    ((uint32_t)25)     /* 25 ms */

//I2C_HandleTypeDef I2cHandle;
#if defined(I2C2_Base)
  #if DEVICE_I2C_ASYNCH
static const IRQn_Type I2cEventIRQs[MODULES_SIZE_I2C] = {  
    I2C1_IRQn,  
    I2C2_IRQn,  
};  
static const IRQn_Type I2cErrorIRQs[MODULES_SIZE_I2C] = {  
    I2C1_IRQn,  
    I2C2_IRQn,  
};
  #endif
#else
  #if DEVICE_I2C_ASYNCH
static const IRQn_Type I2cEventIRQs[MODULES_SIZE_I2C] = {  
    I2C1_IRQn,  
};  
static const IRQn_Type I2cErrorIRQs[MODULES_SIZE_I2C] = {  
    I2C1_IRQn,  
};
  #endif
#endif

I2C_HandleTypeDef t_I2cHandle[MODULES_SIZE_I2C];

int i2c1_inited = 0;
#if defined(I2C2_BASE)
int i2c2_inited = 0;
#endif

#if !DEVICE_I2C_ASYNCH
int i2c_module_lookup(i2c_t *obj)
{
	switch(obj->i2c)
	{
		case I2C_1: return 0;
#if defined(I2C2_Base)
		case I2C_2: return 1;
#endif		
		default: return 0;
	}
}
#else
int i2c_module_lookup(i2c_t *obj)
{
	switch(obj->i2c.i2c)
	{
		case I2C_1: return 0;
#if defined(I2C2_Base)
		case I2C_2: return 1;
#endif		
		default: return 0;
	}
}
#endif

/* Private variables ---------------------------------------------------------*/
static i2c_t *gp_obj = NULL;
//static I2C_HandleTypeDef I2cHandle;
static DMA_HandleTypeDef hdma_i2c1_rx;
static DMA_HandleTypeDef hdma_i2c1_tx;
static unsigned int I2C_data_length_max = 0;

/* I2C event callbacks */
event_cb_t g_cb_s_rx = NULL; // callback for Slave reception completed event
event_cb_t g_cb_s_tx = NULL; // callback for Slave transmission completed event
event_cb_t g_cb_m_rx = NULL; // callback for Master reception completed event
event_cb_t g_cb_m_tx = NULL; // callback for Master transmission completed event
event_cb_t g_cb_e_addr = NULL; // callback for Slave Address Match event
event_cb_t g_cb_e_erro = NULL; // callback for I2C errors event

void i2c_init(i2c_t *obj, PinName sda, PinName scl)
{
    // Determine the I2C to use
    I2CName i2c_sda = (I2CName)pinmap_peripheral(sda, PinMap_I2C_SDA);
    I2CName i2c_scl = (I2CName)pinmap_peripheral(scl, PinMap_I2C_SCL);

#if !DEVICE_I2C_ASYNCH
    obj->i2c = (I2CName)pinmap_merge(i2c_sda, i2c_scl);
    MBED_ASSERT(obj->i2c != (I2CName)NC);
#else
    obj->i2c.i2c = (I2CName)pinmap_merge(i2c_sda, i2c_scl);
    MBED_ASSERT(obj->i2c.i2c != (I2CName)NC);
#endif
	
    // Enable I2C1 clock and pinout if not done
#if !DEVICE_I2C_ASYNCH	
    if ((obj->i2c == I2C_1) && !i2c1_inited) {
#else
    if ((obj->i2c.i2c == I2C_1) && !i2c1_inited) {
#endif			
        i2c1_inited = 1;
        __HAL_RCC_I2C1_CONFIG(RCC_I2C1CLKSOURCE_SYSCLK);
        __I2C1_CLK_ENABLE();
        // Configure I2C pins
        pinmap_pinout(sda, PinMap_I2C_SDA);
        pinmap_pinout(scl, PinMap_I2C_SCL);
        pin_mode(sda, OpenDrain);
        pin_mode(scl, OpenDrain);
    }

#if defined(I2C2_BASE)
    // Enable I2C2 clock and pinout if not done
#if !DEVICE_I2C_ASYNCH	
    if ((obj->i2c == I2C_2) && !i2c2_inited) {
#else
    if ((obj->i2c.i2c == I2C_2) && !i2c2_inited) {
#endif			
        i2c2_inited = 1;
        __I2C2_CLK_ENABLE();
        // Configure I2C pins
        pinmap_pinout(sda, PinMap_I2C_SDA);
        pinmap_pinout(scl, PinMap_I2C_SCL);
        pin_mode(sda, OpenDrain);
        pin_mode(scl, OpenDrain);
    }
#endif

    // Reset to clear pending flags if any
    i2c_reset(obj);

    // I2C configuration
    i2c_frequency(obj, 100000); // 100 kHz per default
}

void i2c_deInit(i2c_t *obj)
{
    HAL_I2C_DeInit(&t_I2cHandle[i2c_module_lookup(obj)]);
}
 
void i2c_frequency(i2c_t *obj, int hz) {
    MBED_ASSERT((hz == 100000) || (hz == 400000) || (hz == 1000000));
#if !DEVICE_I2C_ASYNCH	
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);
#else
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);
#endif	
    int timeout;

