javier-moreno-tridonic-com/mbed-hal-st-stm32f0/source/i2c_api.c
#if !DEVICE_I2C_ASYNCH_DMA

void i2c_transfer_asynch(i2c_t *obj, void *tx, size_t tx_length, void *rx, size_t rx_length, uint32_t address, uint32_t stop, uint32_t handler, uint32_t event, DMAUsage hint)
{
    // TODO: DMA usage is currently ignored  
    (void) hint;  

    // check which use-case we have  
    int use_tx = (tx != NULL && tx_length > 0);  
    int use_rx = (rx != NULL && rx_length > 0);  
  
		obj->tx_buff.buffer = tx;
    obj->tx_buff.length = tx_length;  
    obj->tx_buff.pos = 0;  
    obj->tx_buff.width = 8;  
  
    obj->rx_buff.buffer = rx;  
    obj->rx_buff.length = rx_length;  
    obj->rx_buff.pos = 0;  
    obj->rx_buff.width = 8;  
  
    g_event[i2c_module_lookup(obj)] = event;  
    g_address[i2c_module_lookup(obj)] = address;
    g_stop_previous[i2c_module_lookup(obj)] = g_stop[i2c_module_lookup(obj)];
    g_stop[i2c_module_lookup(obj)] = stop; 
 
    // register the same thunking handler for both event and error interrupt!  
    IRQn_Type event_irq_n = I2cEventIRQs[i2c_module_lookup(obj)];  
    IRQn_Type error_irq_n = I2cErrorIRQs[i2c_module_lookup(obj)]; 
    NVIC_SetVector(event_irq_n, handler);
    NVIC_SetVector(error_irq_n, handler);
    NVIC_EnableIRQ(event_irq_n);
    NVIC_EnableIRQ(error_irq_n);		
  
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);
		
    if (use_tx && use_rx) {  
        // these methods are BLOCKING for creating the start condition and writing the first bytes!  
        if (tx_length == 1) {  
            HAL_I2C_Mem_Read_IT(handle, address, ((uint8_t*)tx)[0], I2C_MEMADD_SIZE_8BIT, rx, rx_length, stop, g_stop_previous[i2c_module_lookup(obj)]);  
        } else if (tx_length == 2) {  
            uint16_t memoryAddress = (((uint8_t*)tx)[0] << 8) | ((uint8_t*)tx)[1];  
            HAL_I2C_Mem_Read_IT(handle, address, memoryAddress, I2C_MEMADD_SIZE_16BIT, rx, rx_length, stop, g_stop_previous[i2c_module_lookup(obj)]);  
        }  
    // these methods are BLOCKING for creating the start condition!  
    } else if (use_tx) {  
        HAL_I2C_Master_Transmit_IT(handle, address, (uint8_t*)tx, tx_length, stop, g_stop_previous[i2c_module_lookup(obj)]);  
    } else if (use_rx) {  
        HAL_I2C_Master_Receive_IT(handle, address, (uint8_t*)rx, rx_length, stop, g_stop_previous[i2c_module_lookup(obj)]);  
    } else {  
        HAL_I2C_Master_Check_IT(handle, address, stop, g_stop_previous[i2c_module_lookup(obj)]);  
    }  
}  
  
uint32_t i2c_irq_handler_asynch(i2c_t *obj)  
{  
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);
  
    /* So we map the event and error interrupt on the same thunking handle.  
     * In order to distinguish between both, we need to check the flags in  
     * the status register.  
     *  
     * The Event interrupt is generated when:  
     *  – SB = 1 (Master)  
     *  – ADDR = 1 (Master/Slave)  
     *  – ADD10 = 1 (Master)  
     *  – STOPF = 1 (Slave)  
     *  – BTF = 1 with no TxE or RxNE event  
     *  – TxE event to 1 if ITBUFEN = 1  
     *  – RxNE event to 1if ITBUFEN = 1  
     *  
     * The Error interrupt is generated when:  
     *  – BERR=1        Misplaced Start or Stop condition  
     *  – ARLO=1        Arbitration lost (only in multi-master mode)  
     *  – AF=1          Acknowledge Failure  
     *  – OVR=1         Overrun/Underrun  
     *  – PECERR = 1    PEC Error in reception (not applicable)  
     *  – TIMEOUT = 1   SCL remained LOW for 25 ms (Timeout) (only in SMBus mode)  
     *  – SMBALERT = 1  SMBus alert (not applicable, we don't use SMBus)  
     *  
     * All these flags are in the Status Register 1, and all event flags are  
     * in the lower 8 bits, while all error flags are in the upper 8 bits.  
     */  
    int status = handle->Instance->ISR;  
    int event = 0;  
    HAL_I2C_StateTypeDef previousState = HAL_I2C_GetState(handle);  
    HAL_I2C_StateTypeDef currentState;  
  
    // check error flags first, since they take presedence over events!  
    if (status & 0x7f00) {  
        // update buffer positions  
        size_t position = handle->XferSize - handle->XferCount;  
        if (previousState & 0x20) {  
            obj->rx_buff.pos = position;  
        } else {  
            obj->tx_buff.pos = position;  
        }  
  
        HAL_I2C_ER_IRQHandler(handle);  
        currentState = HAL_I2C_GetState(handle);  
  
        event = I2C_EVENT_ERROR;  
        if (HAL_I2C_GetError(handle) & HAL_I2C_ERROR_AF) {  
            event |= I2C_EVENT_TRANSFER_EARLY_NACK;  
        }  
  
        return (event & g_event[i2c_module_lookup(obj)]);  
    }  
  
    // check event flags next  
    if (status & 0x00ff) {  
			// busy w/ no stop
				if ((status == 0x8081) || (status == 0x8041)) { 

				 /* Disable ERR, TC, STOP, NACK, TXI interrupt */
					__HAL_I2C_DISABLE_IT(handle,I2C_IT_ERRI | I2C_IT_TCI| I2C_IT_STOPI| I2C_IT_NACKI | I2C_IT_TXI );

					/* Clear Configuration Register 2 */
					I2C_RESET_CR2(handle);

					handle->State = HAL_I2C_STATE_READY;
				
					event = I2C_EVENT_TRANSFER_COMPLETE;
				}
				else{
					HAL_I2C_EV_IRQHandler(handle, g_stop[i2c_module_lookup(obj)]);  
					currentState = HAL_I2C_GetState(handle);  
				
					if (currentState == HAL_I2C_STATE_READY) {  
							// update buffer positions  
							size_t position = handle->XferSize - handle->XferCount;  
							if (previousState & 0x20) {  
									obj->rx_buff.pos = position;  
							} else {  
									obj->tx_buff.pos = position;  
							}  
							event = I2C_EVENT_TRANSFER_COMPLETE;
							
							if(__HAL_I2C_GET_FLAG(handle,I2C_FLAG_AF)) 
							{
								event |= I2C_EVENT_TRANSFER_EARLY_NACK;
							}
					}  
			}
    }  
    return (event & g_event[i2c_module_lookup(obj)]);
}  
  
uint8_t i2c_active(i2c_t *obj)  
{  
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];  
    HAL_I2C_StateTypeDef state = HAL_I2C_GetState(handle);  
  
    switch(state) {  
        case HAL_I2C_STATE_RESET:  
        case HAL_I2C_STATE_READY:  
        case HAL_I2C_STATE_ERROR:  
            return 0;  
        default:  
            return 1;  
     }  
}  
    
void i2c_abort_asynch(i2c_t *obj)  
{  
    i2c_reset(obj);  
}

#if DEVICE_I2CSLAVE
uint32_t gevent=0;
uint32_t ghandler=0;

