javier-moreno-tridonic-com/mbed-hal-st-stm32f0/source/i2c_api.c
void HAL_I2C_SlaveTxCpltCallback(I2C_HandleTypeDef *hi2c)
{
  gevent = I2C_EVENT_TRANSFER_COMPLETE; 
}

void HAL_I2C_SlaveRxCpltCallback(I2C_HandleTypeDef *hi2c)
{
  gevent = I2C_EVENT_TRANSFER_COMPLETE; 
}

void i2c1slave_irq_handler(void)
{
	I2C_HandleTypeDef *handle = &t_I2cHandle[0];
		
	HAL_I2C_EV_IRQHandler(handle,0);
	HAL_I2C_ER_IRQHandler(handle);
	if(handle->XferCount == 0) {
		NVIC_SetVector(I2C1_IRQn, ghandler);
	}
}

void i2c2slave_irq_handler(void)
{
	I2C_HandleTypeDef *handle = &t_I2cHandle[1];

	HAL_I2C_EV_IRQHandler(handle,0);
	HAL_I2C_ER_IRQHandler(handle);
  if(handle->XferCount == 0) {
		NVIC_SetVector(I2C2_IRQn, ghandler);
	}
}

uint32_t t_i2cslave_irq_handler[]={(uint32_t)i2c1slave_irq_handler, (uint32_t)i2c2slave_irq_handler};

void i2cslave_transfer_asynch(i2c_t *obj, void *tx, size_t tx_length, void *rx, size_t rx_length, uint32_t address, uint32_t stop, uint32_t handler, uint32_t event, DMAUsage hint) {

	  // TODO: DMA usage is currently ignored by this way
    (void) hint;  

    // check which use-case we have  
    int use_tx = (tx != NULL && tx_length > 0);  
    int use_rx = (rx != NULL && rx_length > 0);  
  
		obj->tx_buff.buffer = tx;
    obj->tx_buff.length = tx_length;  
    obj->tx_buff.pos = 0;  
    obj->tx_buff.width = 8;  
  
    obj->rx_buff.buffer = rx;  
    obj->rx_buff.length = rx_length;  
    obj->rx_buff.pos = 0;  
    obj->rx_buff.width = 8;  
  
    g_event[i2c_module_lookup(obj)] = event;  
    g_address[i2c_module_lookup(obj)] = address;
    g_stop_previous[i2c_module_lookup(obj)] = g_stop[i2c_module_lookup(obj)];
    g_stop[i2c_module_lookup(obj)] = stop;  
    ghandler=handler;
 
    // register handler for event and error 
    IRQn_Type event_irq_n = I2cEventIRQs[i2c_module_lookup(obj)];  
    IRQn_Type error_irq_n = I2cErrorIRQs[i2c_module_lookup(obj)]; 
    NVIC_SetVector(event_irq_n, (uint32_t)t_i2cslave_irq_handler[i2c_module_lookup(obj)]);
    NVIC_EnableIRQ(event_irq_n);
  
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);
		
    if (use_tx && use_rx) {  
    } else if (use_tx) {
			  __HAL_I2C_CLEAR_FLAG(handle, I2C_FLAG_AF | I2C_FLAG_STOPF);
        HAL_I2C_Slave_Transmit_IT(handle, (uint8_t*)tx, tx_length); 
    } else if (use_rx) {  
        HAL_I2C_Slave_Receive_IT(handle, (uint8_t*)rx, rx_length);  
    }  
}

uint32_t i2cslave_irq_handler_asynch(i2c_t *obj) {
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);  
  
    int event = 0;  
    
    HAL_I2C_EV_IRQHandler(handle,0);
    HAL_I2C_ER_IRQHandler(handle);
		
		if(handle->State == HAL_I2C_STATE_SLAVE_BUSY_TX){
			__HAL_I2C_DISABLE_IT(handle, I2C_IT_ERRI | I2C_IT_TCI | I2C_IT_STOPI | I2C_IT_NACKI | I2C_IT_ADDRI | I2C_IT_RXI | I2C_IT_TXI );
			gevent = I2C_EVENT_TRANSFER_COMPLETE;
		}
		
    handle->State = HAL_I2C_STATE_READY;
    event = gevent;
    gevent=0;
    return (event & g_event[i2c_module_lookup(obj)]);
}

#endif //DEVICE_I2CSLAVE

#else //DEVICE_I2C_ASYNCH_DMA

#if defined(I2C2_Base)
static const IRQn_Type I2C_DMATx_IRQs[MODULES_SIZE_I2C] = {  
    DMA1_Ch2_3_DMA2_Ch1_2_IRQn,  
    DMA1_Ch4_7_DMA2_Ch3_5_IRQn,  
};
static const IRQn_Type I2C_DMARx_IRQs[MODULES_SIZE_I2C] = {  
    DMA1_Ch2_3_DMA2_Ch1_2_IRQn,  
    DMA1_Ch4_7_DMA2_Ch3_5_IRQn,  
};
#else
static const IRQn_Type I2C_DMATx_IRQs[MODULES_SIZE_I2C] = {  
    DMA1_Ch2_3_DMA2_Ch1_2_IRQn,  
};
static const IRQn_Type I2C_DMARx_IRQs[MODULES_SIZE_I2C] = {  
    DMA1_Ch2_3_DMA2_Ch1_2_IRQn,  
};
#endif

int dma_module_lookup(DMA_HandleTypeDef *hdma)
{
	switch((uint32_t)&(hdma->Instance))
	{
    case DMA1_Channel2_BASE:
		case DMA1_Channel3_BASE: return 0;
#if defined(I2C2_Base)
    case DMA1_Channel4_BASE:
		case DMA1_Channel5_BASE: return 1;
#endif		
		default: return 0;
	}
}

static HAL_StatusTypeDef i2c_WaitOnFlagUntilTimeout(I2C_HandleTypeDef *hi2c, uint32_t Flag, FlagStatus Status, uint32_t Timeout)  
{  
  uint32_t tickstart = HAL_GetTick();

  /* Wait until flag is set */
  if(Status == RESET)
  {    
    while(__HAL_I2C_GET_FLAG(hi2c, Flag) == RESET)
    {
      /* Check for the Timeout */
      if(Timeout != HAL_MAX_DELAY)
      {
        if((Timeout == 0) || ((HAL_GetTick() - tickstart) > Timeout))
        {
          hi2c->State= HAL_I2C_STATE_READY;
          /* Process Unlocked */
          __HAL_UNLOCK(hi2c);
          return HAL_TIMEOUT;
        }
      }
    }
  }
  else
  {
    while(__HAL_I2C_GET_FLAG(hi2c, Flag) != RESET)
    {
      /* Check for the Timeout */
      if(Timeout != HAL_MAX_DELAY)
      {
        if((Timeout == 0) || ((HAL_GetTick() - tickstart) > Timeout))
        {
          hi2c->State= HAL_I2C_STATE_READY;
          /* Process Unlocked */
          __HAL_UNLOCK(hi2c);
          return HAL_TIMEOUT;
        }
      }
    }
  }
  return HAL_OK;      
}

static HAL_StatusTypeDef i2c_IsAcknowledgeFailed(I2C_HandleTypeDef *hi2c, uint32_t Timeout)
{
  uint32_t tickstart = 0x00;
  tickstart = HAL_GetTick();

  if(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_AF) == SET)
  {
    /* Generate stop if necessary only in case of I2C peripheral in MASTER mode */
    if((hi2c->State == HAL_I2C_STATE_MASTER_BUSY_TX) || (hi2c->State == HAL_I2C_STATE_MEM_BUSY_TX)
       || (hi2c->State == HAL_I2C_STATE_MEM_BUSY_RX))
    {
      /* No need to generate the STOP condition if AUTOEND mode is enabled */
      /* Generate the STOP condition only in case of SOFTEND mode is enabled */
      if((hi2c->Instance->CR2 & I2C_AUTOEND_MODE) != I2C_AUTOEND_MODE)
      {
        /* Generate Stop */
        hi2c->Instance->CR2 |= I2C_CR2_STOP;
      }
    }
		
    /* Wait until STOP Flag is reset */
    /* AutoEnd should be initiate after AF */
    while(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_STOPF) == RESET)
    {
      /* Check for the Timeout */
      if(Timeout != HAL_MAX_DELAY)
      {
        if((Timeout == 0) || ((HAL_GetTick() - tickstart) > Timeout))
        {
          hi2c->State= HAL_I2C_STATE_READY;
          /* Process Unlocked */
          __HAL_UNLOCK(hi2c);
          return HAL_TIMEOUT;
        }
      }
    }

    /* Clear NACKF Flag */
    __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);

    /* Clear STOP Flag */
    __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_STOPF);

    /* Clear Configuration Register 2 */
    I2C_RESET_CR2(hi2c);

    hi2c->ErrorCode = HAL_I2C_ERROR_AF;
    hi2c->State= HAL_I2C_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(hi2c);

    return HAL_ERROR;
  }
  return HAL_OK;      
}

static HAL_StatusTypeDef i2c_WaitOnSTOPFlagUntilTimeout(I2C_HandleTypeDef *hi2c, uint32_t Timeout)
{  
  uint32_t tickstart = 0x00;
  tickstart = HAL_GetTick();
  
  while(__HAL_I2C_GET_FLAG(hi2c, I2C_FLAG_STOPF) == RESET)
  {
    /* Check if a NACK is detected */
    if(i2c_IsAcknowledgeFailed(hi2c, Timeout) != HAL_OK)
    {
      return HAL_ERROR;
    }

