javier-moreno-tridonic-com/mbed-hal-st-stm32f0/source/i2c_api.c
					if (currentState == HAL_I2C_STATE_READY) {  
							// update buffer positions  
							size_t position = handle->XferSize - handle->XferCount;  
							if (previousState & 0x20) {  
									obj->rx_buff.pos = position;  
							} else {  
									obj->tx_buff.pos = position;  
							}  
							event = I2C_EVENT_TRANSFER_COMPLETE;
					}  
    }
    return (event & g_event[i2c_module_lookup(obj)]);
}  
  
uint8_t i2c_active(i2c_t *obj)  
{  
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];  
    HAL_I2C_StateTypeDef state = HAL_I2C_GetState(handle);  
  
    switch(state) {  
        case HAL_I2C_STATE_RESET:  
        case HAL_I2C_STATE_READY:  
        case HAL_I2C_STATE_ERROR:  
            return 0;  
        default:  
            return 1;  
     }  
}  
    
void i2c_abort_asynch(i2c_t *obj)  
{  
    i2c_reset(obj);  
}

#if DEVICE_I2CSLAVE
uint32_t gevent=0;

void dma_rx_cb(DMA_HandleTypeDef *hdma)
{
  gevent = I2C_EVENT_TRANSFER_COMPLETE; 
}

void dma_tx_cb(DMA_HandleTypeDef *hdma)
{
  gevent = I2C_EVENT_TRANSFER_COMPLETE; 
}

void i2cslave_transfer_asynch(i2c_t *obj, void *tx, size_t tx_length, void *rx, size_t rx_length, uint32_t address, uint32_t stop, uint32_t handler, uint32_t event, DMAUsage hint)
{
    // TODO: DMA usage is currently ignored by this way
    (void) hint;  

    // check which use-case we have  
    int use_tx = (tx != NULL && tx_length > 0);  
    int use_rx = (rx != NULL && rx_length > 0);  
  
		obj->tx_buff.buffer = tx;
    obj->tx_buff.length = tx_length;  
    obj->tx_buff.pos = 0;  
    obj->tx_buff.width = 8;  
  
    obj->rx_buff.buffer = rx;  
    obj->rx_buff.length = rx_length;  
    obj->rx_buff.pos = 0;  
    obj->rx_buff.width = 8;  
  
	  g_event[i2c_module_lookup(obj)] = event;  
    g_address[i2c_module_lookup(obj)] = address;
    g_stop_previous[i2c_module_lookup(obj)] = g_stop[i2c_module_lookup(obj)];
    g_stop[i2c_module_lookup(obj)] = stop;  
 
    /* NVIC configuration for DMA transfer complete interrupt (I2C_TX) */
    NVIC_SetVector(I2C_DMATx_IRQs[i2c_module_lookup(obj)], handler);
    HAL_NVIC_SetPriority(I2C_DMATx_IRQs[i2c_module_lookup(obj)], 0, 1);
    HAL_NVIC_EnableIRQ(I2C_DMATx_IRQs[i2c_module_lookup(obj)]);
      
    /* NVIC configuration for DMA transfer complete interrupt (I2C_RX) */
    NVIC_SetVector(I2C_DMARx_IRQs[i2c_module_lookup(obj)], handler);
    HAL_NVIC_SetPriority(I2C_DMARx_IRQs[i2c_module_lookup(obj)], 0, 0);   
    HAL_NVIC_EnableIRQ(I2C_DMARx_IRQs[i2c_module_lookup(obj)]);		
  
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);
		
    if (use_tx && use_rx) {  
    } else if (use_tx) {
        HAL_I2C_Slave_Transmit_DMA(handle, (uint8_t*)tx, tx_length); 
    } else if (use_rx) {  
        HAL_I2C_Slave_Receive_DMA(handle, (uint8_t*)rx, rx_length);  
    }  
}  

uint32_t i2cslave_irq_handler_asynch(i2c_t *obj)  
{  
    I2C_HandleTypeDef *handle = &t_I2cHandle[i2c_module_lookup(obj)];
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c.i2c);  
  
    int event = 0;  
    
    handle->hdmatx->XferCpltCallback = dma_tx_cb;
    handle->hdmarx->XferCpltCallback = dma_rx_cb;
    HAL_DMA_IRQHandler(handle->hdmarx);
    HAL_DMA_IRQHandler(handle->hdmatx);
    handle->State = HAL_I2C_STATE_READY;
    event = gevent;
    gevent=0;
    return (event & g_event[i2c_module_lookup(obj)]);
}  


#endif // DEVICE_I2CSLAVE

#endif //!DEVICE_I2C_ASYNCH_DMA

#endif // DEVICE_I2C_ASYNCH





#ifdef DEVICE_I2C_DMA

/* Mechanism to enable own address acknowledge */
void i2c_ack_own_address(i2c_t *obj)
{
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);

    /* Enable Address Acknowledge */
    t_I2cHandle[i2c_module_lookup(obj)].Instance->CR2 &= ~I2C_CR2_NACK;
}

/* Mechanism to disable own address acknowledge */
void i2c_nack_own_address(i2c_t *obj)
{
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);

    /* Disable Address Acknowledge */
    t_I2cHandle[i2c_module_lookup(obj)].Instance->CR2 |= I2C_CR2_NACK;
}

void i2c_set_own_address(i2c_t *obj, uint32_t address)
{
    t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);

    uint16_t tmpreg = 0;
    // Get the old register value
    tmpreg = t_I2cHandle[i2c_module_lookup(obj)].Instance->OAR1;
    // Reset address bits
    tmpreg &= 0xFC00;
    // Set new address
    // Disable OA1EN in order to change own address
    t_I2cHandle[i2c_module_lookup(obj)].Instance->OAR1 &= ~ I2C_OAR1_OA1EN;

    tmpreg |= (uint16_t)((uint16_t)address & (uint16_t)0x00FE); // 7-bits
    // Store the new register value
    t_I2cHandle[i2c_module_lookup(obj)].Instance->OAR1 = tmpreg;
    // Own address 1 enable
    t_I2cHandle[i2c_module_lookup(obj)].Instance->OAR1 |= I2C_OAR1_OA1EN;
}

void i2c_register_event_cb(
		event_cb_t cb_s_rx,
		event_cb_t cb_s_tx,
		event_cb_t cb_m_rx,
		event_cb_t cb_m_tx,
		event_cb_t cb_e_addr,
		event_cb_t cb_e_erro)
{
	if(cb_s_rx)	g_cb_s_rx = cb_s_rx;
	if(cb_s_tx)	g_cb_s_tx = cb_s_tx;
	if(cb_m_rx)	g_cb_m_rx = cb_m_rx;
	if(cb_m_tx)	g_cb_m_tx = cb_m_tx;
	if(cb_e_addr) g_cb_e_addr = cb_e_addr;
	if(cb_e_erro) g_cb_e_erro = cb_e_erro;
}

int i2c_enable_i2c_it(i2c_t *obj)
{
	t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);

	if(t_I2cHandle[i2c_module_lookup(obj)].State == HAL_I2C_STATE_READY)
	{
	    if(__HAL_I2C_GET_FLAG(&t_I2cHandle[i2c_module_lookup(obj)], I2C_FLAG_BUSY) == SET)
	    {
	      return HAL_BUSY;
	    }

	    /* Process Locked */
	    __HAL_LOCK(&t_I2cHandle[i2c_module_lookup(obj)]);

	    //t_I2cHandle[i2c_module_lookup(obj)].State = HAL_I2C_STATE_READY;
	    t_I2cHandle[i2c_module_lookup(obj)].ErrorCode = HAL_I2C_ERROR_NONE;

	    /* Enable Address Acknowledge */
	    t_I2cHandle[i2c_module_lookup(obj)].Instance->CR2 &= ~I2C_CR2_NACK;

	    /* Process Unlocked */
	    __HAL_UNLOCK(&t_I2cHandle[i2c_module_lookup(obj)]);

	    /* Note : The I2C interrupts must be enabled after unlocking current process
	              to avoid the risk of I2C interrupt handle execution before current
	              process unlock */

