javier-moreno-tridonic-com/mbed-hal-st-stm32f0/source/i2c_api.c
	    /* Enable EVT, BUF and ERR interrupt | I2C_IT_BUF */
	    __HAL_I2C_ENABLE_IT(&t_I2cHandle[i2c_module_lookup(obj)], I2C_IT_ADDRI | I2C_IT_ERRI | I2C_IT_STOPI);

	    return HAL_OK;
	}
	else
	{
	   return HAL_BUSY;
	}
}

int i2c_master_transmit_DMA(i2c_t *obj, int address, const unsigned char *data, int length, char stop)
{
	HAL_StatusTypeDef status = HAL_ERROR;
	t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);

        /* Master transmit data */
	status = HAL_I2C_Master_Transmit_DMA(&t_I2cHandle[i2c_module_lookup(obj)], address, data, length, stop);

	return status;
}

int i2c_master_receive_DMA(i2c_t *obj, int address, unsigned char *data, int length, char stop)
{
	HAL_StatusTypeDef status = HAL_ERROR;
	t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);

	/* Master receive data */
	status = HAL_I2C_Master_Receive_DMA(&t_I2cHandle[i2c_module_lookup(obj)], address, data, length, stop);

	return status;
}

int i2c_slave_transmit_DMA(i2c_t *obj, const unsigned char *data, int length)
{
	HAL_StatusTypeDef status = HAL_ERROR;

	I2C_data_length_max = length;
	t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);
	status = HAL_I2C_Slave_Transmit_DMA(&t_I2cHandle[i2c_module_lookup(obj)], data, length);

	return status;
}

int i2c_slave_receive_DMA(i2c_t *obj, unsigned char *data, int length)
{
	HAL_StatusTypeDef status = HAL_ERROR;

	I2C_data_length_max = length;
	t_I2cHandle[i2c_module_lookup(obj)].Instance = (I2C_TypeDef *)(obj->i2c);
	status = HAL_I2C_Slave_Receive_DMA(&t_I2cHandle[i2c_module_lookup(obj)], data, length);

	return status;
}

/**
  * Initializes the Global MSP.
  */
void HAL_I2C_MspInit(I2C_HandleTypeDef *hi2c)
{
	if(hi2c->Instance == I2C1)
	{
		/* DMA controller clock enable */
		__DMA1_CLK_ENABLE();

	  /* Peripheral DMA init*/
		hdma_i2c1_rx.Instance = DMA1_Channel3;
		hdma_i2c1_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
		hdma_i2c1_rx.Init.PeriphInc = DMA_PINC_DISABLE;
		hdma_i2c1_rx.Init.MemInc = DMA_MINC_ENABLE;
		hdma_i2c1_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
		hdma_i2c1_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
		hdma_i2c1_rx.Init.Mode = DMA_NORMAL;
		hdma_i2c1_rx.Init.Priority = DMA_PRIORITY_VERY_HIGH;
		HAL_DMA_Init(&hdma_i2c1_rx);

		__HAL_DMA1_REMAP(HAL_DMA1_CH3_I2C1_RX);

		__HAL_LINKDMA(hi2c,hdmarx,hdma_i2c1_rx);

		hdma_i2c1_tx.Instance = DMA1_Channel2;
		hdma_i2c1_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
		hdma_i2c1_tx.Init.PeriphInc = DMA_PINC_DISABLE;
		hdma_i2c1_tx.Init.MemInc = DMA_MINC_ENABLE;
		hdma_i2c1_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
		hdma_i2c1_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
		hdma_i2c1_tx.Init.Mode = DMA_NORMAL;
		hdma_i2c1_tx.Init.Priority = DMA_PRIORITY_VERY_HIGH;
		HAL_DMA_Init(&hdma_i2c1_tx);

		__HAL_DMA1_REMAP(HAL_DMA1_CH2_I2C1_TX);

		__HAL_LINKDMA(hi2c,hdmatx,hdma_i2c1_tx);

		/* DMA interrupt init */
		HAL_NVIC_SetPriority(DMA1_Ch2_3_DMA2_Ch1_2_IRQn, 1, 0);
		HAL_NVIC_EnableIRQ(DMA1_Ch2_3_DMA2_Ch1_2_IRQn);

		/* I2C interrupt init */
		HAL_NVIC_SetPriority(I2C1_IRQn, 1, 0);
		HAL_NVIC_EnableIRQ(I2C1_IRQn);
	}
}

void HAL_I2C_MspDeInit(I2C_HandleTypeDef* hi2c)
{
	if(hi2c->Instance == I2C1)
	{
		/* Peripheral clock disable */
		__I2C1_CLK_DISABLE();

		/* Peripheral interrupt DeInit*/
		HAL_NVIC_DisableIRQ(I2C1_IRQn);

		/**I2C1 GPIO Configuration
		PB6     ------> I2C1_SCL
		PB7     ------> I2C1_SDA
		*/
		HAL_GPIO_DeInit(GPIOB, GPIO_PIN_6|GPIO_PIN_7);

		/* Peripheral DMA DeInit*/
    	HAL_DMA_DeInit(hi2c->hdmarx);
    	HAL_DMA_DeInit(hi2c->hdmatx);
	}
}

/**
* @brief This function handles DMA1 channel 2 to 3 and DMA2 channel 1 to 2 interrupts.
*/
void DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler(void)
{
  HAL_DMA_IRQHandler(&hdma_i2c1_tx);
  HAL_DMA_IRQHandler(&hdma_i2c1_rx);
}

/**
* @brief This function handles I2C1 global interrupt (combined with EXTI line 23 interrupt).
*/
void I2C1_IRQHandler(void)
{
	uint16_t dataCnt = 0;

	if (t_I2cHandle[i2c_module_lookup(gp_obj)].Instance->ISR & (I2C_FLAG_BERR | I2C_FLAG_ARLO | I2C_FLAG_OVR)) {
		HAL_I2C_ER_IRQHandler(&t_I2cHandle[i2c_module_lookup(gp_obj)]);
	}
	else {
		/* I2C Slave address match  ---------------------------------------------------*/
		if ((__HAL_I2C_GET_FLAG(&t_I2cHandle[i2c_module_lookup(gp_obj)], I2C_FLAG_ADDR) == SET) &&
		   (__HAL_I2C_GET_IT_SOURCE(&t_I2cHandle[i2c_module_lookup(gp_obj)], I2C_IT_ADDRI) == SET))
		{
			t_I2cHandle[i2c_module_lookup(gp_obj)].tDir = __HAL_I2C_GET_FLAG(&t_I2cHandle[i2c_module_lookup(gp_obj)], I2C_FLAG_DIR);
			/* Clear ADDR flag */
			__HAL_I2C_CLEAR_FLAG(&t_I2cHandle[i2c_module_lookup(gp_obj)], I2C_FLAG_ADDR);
			/* Call Address Matched callback */
			g_cb_e_addr(&t_I2cHandle[i2c_module_lookup(gp_obj)]);
		}

		/* I2C Slave received Stop */
		if ((__HAL_I2C_GET_FLAG(&t_I2cHandle[i2c_module_lookup(gp_obj)], I2C_FLAG_STOPF) == SET) &&
		   (__HAL_I2C_GET_IT_SOURCE(&t_I2cHandle[i2c_module_lookup(gp_obj)], I2C_IT_STOPI) == SET))
		{
			if(t_I2cHandle[i2c_module_lookup(gp_obj)].State == HAL_I2C_STATE_SLAVE_BUSY_RX)
			{
				/* Calculate number of received bytes */
				dataCnt = I2C_data_length_max - (hdma_i2c1_rx.Instance->CNDTR);
				/* Set actual received size */
				t_I2cHandle[i2c_module_lookup(gp_obj)].XferSize = dataCnt;

				/* Disable DMA Request */
				t_I2cHandle[i2c_module_lookup(gp_obj)].Instance->CR1 &= ~I2C_CR1_RXDMAEN;

				/* Disable DMA RX Channel */
				HAL_DMA_Abort(&hdma_i2c1_rx);

				/* Configure DMA Stream data length */
				//hdma_i2c1_rx.Instance->CNDTR = I2C_DATA_LENGTH_MAX;
				HAL_I2C_SlaveRxCpltCallback(&t_I2cHandle[i2c_module_lookup(gp_obj)]);
			}
			/* Clear STOP Flag */
			__HAL_I2C_CLEAR_FLAG(&t_I2cHandle[i2c_module_lookup(gp_obj)], I2C_FLAG_STOPF);
			t_I2cHandle[i2c_module_lookup(gp_obj)].State = HAL_I2C_STATE_READY;
		}
  }
}

/**
  * @brief  Master Tx Transfer completed callback.
  * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef *hi2c)
{
	g_cb_m_tx(hi2c);
}

/**
  * @brief  Master Rx Transfer completed callback.
  * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef *hi2c)
{
	g_cb_m_rx(hi2c);
}

/** @brief  Slave Tx Transfer completed callback.
  * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
void HAL_I2C_SlaveTxCpltCallback(I2C_HandleTypeDef *hi2c)
{
	g_cb_s_tx(hi2c);
}

/**
  * @brief  Slave Rx Transfer completed callback.
  * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
void HAL_I2C_SlaveRxCpltCallback(I2C_HandleTypeDef *hi2c)
{
	g_cb_s_rx(hi2c);
}

/**
  * @brief  I2C error callback.
  * @param  hi2c: pointer to a I2C_HandleTypeDef structure that contains
  *         the configuration information for I2C module
  * @retval None
  */
void HAL_I2C_ErrorCallback(I2C_HandleTypeDef *hi2c) {
	g_cb_e_erro(hi2c);
}

#endif //DEVICE_I2C_DMA

#endif // DEVICE_I2C
